RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/board/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AON_08 (coord B1), LPUART1_TXD/U61[4]/J39[4]/J70[4] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_TXD_SIGNAL                                    TXD   /*!< Signal name */

/* GPIO_AON_09 (coord A5), LPUART1_RXD/U61[3]/J39[2]/J70[3] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_RXD_SIGNAL                                    RXD   /*!< Signal name */

/* GPIO_AD_27 (coord M16), USER_LED_CTL1/Q7[1] */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED_CTL1_PERIPHERAL                           RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED_CTL1_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED_CTL1_CHANNEL                                 27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO                                 RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED_CTL1_INIT_GPIO_VALUE                          0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO_PIN                                27U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO_PIN_MASK                   (1U << 27U)   /*!< GPIO pin mask */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
